{
	"projects": [
	{
		"id": 0,
		"title": "Chatty App",
		"github_url": "https://github.com/nss-evening-cohort-06/chatty-moose-planets",
		"img": "https://user-images.githubusercontent.com/30091921/30835704-2f04e636-a21f-11e7-8536-c1cad7a057df.gif",
		"contributors":"Matt Hensley, John Anchor, Caitlin Murnick and Brooke Lewis", 
		"description": "Chat app made for users to send and receive messages, switch from light to dark theme, edit messages and choose from multiple users."
	},
	{
		"id": 1,
		"title": "Cat Gif Generator",
		"github_url": "https://github.com/belv2c/adopt-my-cats",
		"img": "https://user-images.githubusercontent.com/30091921/31305617-a1098682-ab03-11e7-9c7e-fe6905e1ef03.gif",
		"description": "An app that calls API data and displays cats based on the number of toes that they have."
	}

],
	"blogs": [
	{
		"id": 0,
		"title": "JavaScript",
		"content": "Class on July 24th started out with a lot of JavaScript review from our Treehouse exercises. Lauren went over numbers, strings, objects and booleans. We also discussed uses for and situations in which we would want to use statements vs. compound statements, increments or decrements and Object Property Access such as console.log(). As a class we dove deeper into literals (values that are included directly in the source code). For example, string literals are surrounded by double quotes or single quotes based on personal stylistic preferences. Additionally, we reviewed number and boolean literals that are presented as is (42, true, etc.). We also discussed arrays which are objects that hold any type of values in numerically indexed positions. The concept of arrays starting at index 0 took me some time to fully grasp. After going over the different array syntaxes and their return values (shift, unshift, reverse, sort, slice and splice) I was feeling confident in my overall understanding of JavaScript - until we started For Loops. Combining the concepts of Arrays and For Loops was my first big hurdle in JavaScript. After a lot of in class practice and some group member hangs - it finally came together.",
		"date": "July 24, 2017"
	},
	{
		"id": 1,
		"title": "The Terminal",
		"content": "After spending a lot of time working on core JavaScript concepts, we moved on to learning more terminal commands for Github. Since learning these new commands I am able to be more efficient when using the terminal. A few of the new commands we learned were git reset --hard, git reset, git rm --cached, git branch -d (branch name), git branch -b (branch name) and git merge (branch name). Our next big challenge was working through merge conflicts in Github as a group. Git diff has been one of the most helpful commands I’ve learned in order to see what’s going on before I add files to Github. Discovering that if you type the file name after git diff you can display only the changes that you made to a specific file was life changing. Git reset —hard and git fetch were very helpful in my group project, but I’ll discuss that more in my next blog post!",
		"date": "July 29, 2017"
	},
	{
		"id": 2,
		"title": "Merge Conflicts",
		"content": "During the first week of August, we mainly focused on a group project - which was to create a fictitious shop page while working through merge conflicts in Github. This was one of the more challenging group projects as we had to learn to make our code work together as a team. After we were assigned the project, we spent the remainder of our evening wire-framing and creating cards in Github Projects. After delegating our tasks to each team member, we finally hit a point where we felt comfortable enough to start coding our shop page called “FGBG” (For Guineas By Guineas). FGBG is a guinea pig attire company run by guinea pigs. The project itself was not very difficult. I had a pretty clear idea of what code I needed to write to get the job done. On Wednesday night when we started coding, I don’t think that any of us were able to write any actual code due to working through so many merge conflicts. This was the week that I had to start kicking myself for not checking out of my master branch before I started writing code. I’m a pro in merge conflicts now and Jessica created a sticker to put on our laptops as a quick reference to get through them. After we got the hang of working on projects as a group, the rest of the time we had to work on it went smoothly - we even finished our project a little early! Without the help of my group members, I wouldn’t have survived merge conflicts. Also, if you want to discover a weird subculture of the internet, Google “guinea pig attire”.",
		"date": "July 31, 2017"
	},
	{
		"id": 3,
		"title": "Event Listeners and Markdown",
		"content": "Over the last couple of weeks, event listeners have consumed my life. For our assignment “Guinea Pigs” (different from the Guinea Pig group project I wrote about in my last blog) we had to create various event listeners and also target CSS through JavaScript. Guinea Pigs was an easy assignment for me and I felt confident about writing event listeners. Then came the WYSIWYG (What you see is what you get) assignment where we had to traverse the DOM - which I was not feeling great about. Toward the end of our study group session, Callan sat down with me and explained the concept in a way that made sense. Aside from event listeners, we spent a night in class learning Github markdown in order to make super cool README files. My group member Alex added a demo to his wysiwyg README which I thought was really awesome, so I did the same. I used RecordIt which records a selection of your screen and I saved it as a gif file in Photoshop.",
		"date": "August 22, 2017"
	},
	{
		"id": 4,
		"title": "Browserify",
		"content": "Browserify is great. Separating my javascript files into modules makes it SO much easier to read code. Grunt has been really helpful also. Sometimes I get annoyed with Grunt always bouncing at me but it’s a nifty tool when you’re working with a million curly brackets and semi-colons.",
		"date": "September 18, 2017"
	},
		{
		"id": 5,
		"title": "jQuery",
		"content": "JQuery definitely helps to simplify JavaScript and save time. It’s easy to use and seems to have a pretty large library. I’d like to learn more about minifying the framework. I have been looking forward to not traversing the Dom with vanilla JavaScript anymore so that’s a plus. In retrospective, writing vanilla javascript is much more difficult than JQuery but now I have a pretty solid understanding of what’s going on behind the scenes of the jQuery framework.",
		"date": "October 7, 2017"
	},
	{
		"id": 6,
		"title": "Promises",
		"content": "Currently, we are learning how to use promises. I hope that this will make the asynchronous operations issues easier to deal with. It’s nice to be able to handle errors this way but they are a little difficult to debug.",
		"date": "October 17, 2017"
	},
	{
		"id": 7,
		"title": "API's",
		"content": "I’ve been looking forward to learning about API’s for a while and they are an awesome resource to be able to access open source data. I really enjoy reading through the documentation of API’s in order to see how much you can really do with data. The weather application that we are building has been one of my favorite projects so far. While using Open Weather Map’s API - I discovered Erik Flower’s icon set. I wasn’t very impressed with the icons from OWM’s database and wanted to load in my own without having to write a huge conditional to match every icon id. In the API section of https://erikflowers.github.io/weather-icons/, he already integrated this feature with a lot of the main weather API’s. All I had to do was add some files, link the font and write the logic to loop through the icon id’s.",
		"date": "October 24, 2017"
	},
	{
		"id": 8,
		"title": "Firebase",
		"content": "Firebase seems to be a really cool platform to work with data and/or API’s. I’m not totally sure how I feel about it yet - it’s nice that we can add Google authentication functionality to our pages now and it feels like we are making more usable webpages now. However, it’s a little weird that it doesn’t work with Google Chrome all of the time and I always have to have a second web browser open when I use it. One part of Firebase that I really enjoy is seeing the data update live. ",
		"date": "October 31, 2017"
	},
	{
		"id": 9,
		"title": "Group Project",
		"content": "Our most recent group project required us to re-create Disney’s Magic Kingdom’s website and deploy it through Firebase. This project helped me to get a better grasp on utilizing data. Additionally, I learned a lot about using Moment.js to get a Bootstrap widget time picker to work with our data. Using moment and learning how to format time was a super cool learning experience.",
		"date": "November 11, 2017"
	},
	{
		"id": 10,
		"title": "AngularJS",
		"content": "As of the last week we have been learning AngularJS and I am finding it to be very useful when it comes to re-using code and organizing modules. Angular has improved my ability to code more efficiently as I am now able to separate the data, logic, and page view into separate files. I can’t wait to dive deeper into the framework and learn more about the AngularJS directives. Also, I created this Angular Gist which has been super helpful since file setup is a bit more complex now: https://gist.github.com/belv2c/f16c3739da0df32845c2ae3383bedbb6.",
		"date": "November 20, 2017"
	},
		{
		"id": 11,
		"title": "AngularJS Continued",
		"content": "This week we created a contact app and I am feeling confident in my understanding of Angular. Currently, we are planning out our capstone projects which is our final assignment of the front-end course. I plan to build a color palette generator and have been planning how I will structure my application and what functionalities I will be including in the MVP version. One thing that I need to get better about is closing tabs in my text editor. Things get pretty complicated when you’re working in multiple files at one time and have 10 tabs open. However, I’m really excited to build my capstone in Angular. After my planning phase, I’d like to research angular page transition animations and incorporate those into my app.",
		"date": "November 27, 2017"
	}

  ]
}